Repository: 1059059/BotBuilder
Catalog: CSharp/Library/MultilingualResources/Microsoft.Bot.Builder.*.xlf
Languages: it

# CommandBackup
source: Backup
it: Indietro

# CommandBackupTerms
source: backup;go back;back
it: indietro;torna indietro;torna

# CommandHelp
source: Help
it: Aiuto

# CommandHelpHelp
source: Help: Show the kinds of responses you can enter.
it: Aiuto: Mostra i tipi di risposta che puoi inserire.

# CommandHelpTerms
source: help;choices;\?
it: aiuto;opzioni;\?

# CommandQuit
source: Quit
it: Chiudi

# CommandQuitHelp
source: Quit: Quit the form without completing it.
it: Chiudi: Chiudi la form senza completarla.

# CommandReset
source: Start over
it: Rinizia da capo

# CommandResetHelp
source: Reset: Start over filling in the form. (With defaults from your previous entries.)
it: Reset: Rinizia a completare la form. (Con i valori predefiniti delle volte precedenti.)

# CommandResetTerms
source: start over;reset;clear
it: rinizia da capo;reset;clear

# CommandStatus
source: Status
it: Stato

# CommandStatusHelp
source: Status: Show your progress in filling in the form so far.
it: Stato: Mostra lo stato del completamento della form fino ad ora.

# CommandStatusTerms
source: status;progress;so far;results
it: stato;avanzamento;fino ad ora;risultati

# LanguageArticles
source: a;an;the
it: un;uno;una;un';il;la;gli;le;lo

# MatchCurrentChoice
source: Current Choice('c');current;c;current choice;no change
it: scelta attuale('c');attuale;c;scelta attuale;nessun cambiamento

# MatchNoPreference
source: No Preference;no;none;I don'?t care
it: nessuna preferenza;no;nessuna;nessuno;non mi interessa

# MatchYes
source: Yes;y;sure;ok;yep
it: sì;sicuro,ok

# PromptRetry
source: I didn't understand. Say something in reply.
it: Non ho capito. Rispondi qualcosa.

# TemplateBool
source: Would you like a {&}? {||}
it: Vorresti un/una {&}? {||}

# TemplateBoolHelp
source: Please enter 'yes' or 'no'{?, {0}}.
it: Per favore rispondi 'sì' o 'no'{?, {0}}.

# TemplateClarify
source: By "{0}" {&} did you mean {||}
it: Con "{0}" {&} intendi {||}

# TemplateCurrentChoice
source: (current choice: {})
it: (scelta attuale: {})

# TemplateDateTime
source: Please enter a date and time for {&} {||}
it: Inserisci la data e ora per {&} {||}

# TemplateDateTimeHelp
source: Please enter a date or time expression {?, {0}}{?, {1}}.
it: Inserisci una data o un'espressione del tempo {?, {0}}{?, {1}}.

# TemplateDouble
source: Please enter a number {?between {0:F1} and {1:F1}} for {&} {||}
it: Inserisci un numero {? tra {0:F1} e {1:F1}} per {&} {||}

# TemplateEnumManyNumberHelp
source: You can enter one or more numbers {0}-{1} or words from the descriptions. ({2})
it: Puoi inserire uno o più numeri {0}-{1} o parole dalle descrizioni. ({2})

# TemplateEnumManyWordHelp
source: You can enter in one or more selections from the descriptions. ({2})
it: Puoi inserire una o più selezioni dalle descrizioni. ({2})

# TemplateEnumOneNumberHelp
source: You can enter a number {0}-{1} or words from the descriptions. ({2})
it: Puoi inserire un numero {0}-{1} o delle parole dalle descrizioni. ({2})

# TemplateEnumOneWordHelp
source: You can enter in any words from the descriptions. ({2})
it: Puoi inserire qualsiasi parola dalle descrizioni. ({2})

# TemplateEnumSelectMany
source: Please select one or more {&} {||}
it: Seleziona uno o più {&} {||}

# TemplateEnumSelectOne
source: Please select a {&} {||}
it: Seleziona un/una {&} {||}

# TemplateHelp
source: You are filling in the {&} field. Possible responses: {0} {1}
it: Stai inserendo il campo {&}. Risposte possibili: {0} {1}

# TemplateHelpClarify
source: You are clarifying a {&} value. Possible responses: {0} {1}
it: Stai specificando un valore {&}. Risposte possibili: {0} {1}

# TemplateHelpConfirm
source: Please answer the question. Possible responses: {0} {1}
it: Per favore rispondi alla domanda. Risposte possibili: {0} {1}

# TemplateHelpNavigation
source: Choose what field to change. Possible responses: {0} {1}
it: Scegli il campo da cambiare. Risposte possibili: {0} {1}

# TemplateInteger
source: Please enter a number{? between {0} and {1}} for {&} {||}
it: Inserisci un numero {? tra {0} e {1}} per {&} {||}

# TemplateIntegerHelp
source: You can enter a number{? between {2} and {3}}{?, {0}}{?, {1}}.
it: Puoi inserire un numero{? tra {2} e {3}}{?, {0}}{?, {1}}.

# TemplateNavigation
source: What do you want to change? {||}
it: Cosa vuoi cambiare? {||}

# TemplateNavigationCommandHelp
source: You can switch to another field by entering its name. ({0}).
it: Puoi passare ad un altro campo inserendone il nome. ({0}).

# TemplateNavigationHelp
source: Choose {?a number from {0}-{1}, or} a field name.
it: Scegli {?un numero da {0}-{1}, o} il nome di un campo.

# TemplateNoPreference
source: No Preference
it: Nessuna preferenza

# TemplateString
source: Please enter {&} {||}
it: Per favore inserisci {&} {||}

# TemplateStringHelp
source: You can enter anything (use "'s to force string){?, {0}}{?, {1}}.
it: Puoi inserire qualsiasi cosa (usa "'s per forzare una stringa){?, {0}}{?, {1}}.

# TemplateUnspecified
source: Unspecified
it: Non specificato
